@echo off

rem ++++++++++++++++++++++++++++++++++++++++
rem + 第1引数：ソースフォルダ(必須)
rem ++++++++++++++++++++++++++++++++++++++++
set PARAM_1=C:\Users\himeshima\Desktop\onwardテストリサイズ\

rem ++++++++++++++++++++++++++++++++++++++++
rem + 第2引数：出力フォルダ(必須)
rem +++++++++++++++++++++++++++++++++++++++
set PARAM_2=C:\Users\himeshima\Desktop\onwardテスト\

rem ++++++++++++++++++++++++++++++++++++++++
rem + 第3引数：リサイズフラグ(必須) ※幅790にリサイズする
rem ++++++++++++++++++++++++++++++++++++++++
set PARAM_3=true

rem ++++++++++++++++++++++++++++++++++++++++
rem + 第4引数：トリミングフラグ(必須) ※縦1540超える場合、1540毎にトリミングする。横が790までトリミングする
rem ++++++++++++++++++++++++++++++++++++++++
set PARAM_4=false

rem ****** 以降は実行コマンドです。必要のない限り修正しないでください。******
set _JARPATH=.\libs\resize.jar
%_JAVAPATH% -jar %_JARPATH% %PARAM_1% %PARAM_2% %PARAM_3% %PARAM_4%

pause
exit

